const 입력값 = `이대표,'333,356,766','S은행','100-0000-0000-001'
최차장,'5,000,000','S은행','100-0000-0000-002'
이과장,'3,200,000','S은행','100-0000-0000-003'
홍팀장,'3,300,000','S은행','100-0000-0000-004'
이대리,'5,300,000','S은행','100-0000-0000-005'`;

const 나눠진입력값 = 입력값.split("\n");
const 숫자값 = [];

for (let i of 나눠진입력값) {
  let j = i.split(",");
  let k = j.slice(1, j.length - 2); // 첫번째부터 뒤에서 -2번째 전까지
  숫자값.push(k.join(""));
}

console.log(숫자값);
let 월급하나 = "";
let 월급둘 = "";
let result = [];
for (let i of 숫자값) {
  for (let s of i) {
    if (s === "'") {
    } else {
      if (s === "3") {
        월급하나 += "1";
        월급둘 += "2";
      } else if (s === "4") {
        월급하나 += "2";
        월급둘 += "2";
      } else if (s === "6") {
        월급하나 += "1";
        월급둘 += "5";
      } else {
        월급하나 += s;
        월급둘 += "0";
      }
    }
  }
  result.push([parseInt(월급하나, 10), parseInt(월급둘, 10)]);
  월급하나 = "";
  월급둘 = "";
}

console.log(result);
